# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.

userNumber = int(input("Введите число: "))

print("Если прибавить к вашему числу 2, то получится:", userNumber + 2)

input("\nНажмите Enter, чтобы выйти.")
