# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

a = 5
b = 7

print("a =", a)
print("b =", b)
print("a + b =", a + b)

name = input("Как тебя зовут? ")
print("Привет,", name + "!")

input("\nНажмите Enter, чтобы выйти.")
